// 1. Запросіть у користувача його рік народження, підрахуйте скільки йому років і виведіть результат. Поточний рік вкажіть у коді як константу.

// 2. Запросіть у користувача відстань у кілометрах між двома містами та за скільки годин він хоче дістатися. Порахуйте швидкість, з якою потрібно рухатися, щоб встигнути вчасно.

// 3. Запросіть у користувача його вік та визначіть, ким він є: дитиною (0–12), підлітком (12–18), дорослим (18–60) або пенсіонером (60– …).

// 4. Запросіть у користувача тризначне число та перевірте чи є в ньому однакові цифри.

// 5. Напишіть конвертор валют. Користувач вводить кількість USD, вибирає в яку валюту хоче перекласти: EUR, UAN або AZN, і отримує відповідну суму.

// 6. Запросіть у користувача рік та перевірте чи є він високосним. Високосний рік або кратний 400, або кратний 4 і при цьому не кратний 100.

// 7. Зацикліть калькулятор. Запросіть у користувача 2 числа і знак, розв’яжіть приклад, виведіть результат і запитайте, чи хоче він розв’язати ще один приклад. І так триватиме доти, доки користувач не відмовиться.

// 8. Виведіть таблицю множення для всіх чисел від 2 до 9. Кожне число необхідно помножити на числа від 1 до 10.

// 9. Підрахуйте суму всіх чисел у заданому користувачем діапазоні.

// 10. Запросіть 2 числа і знайдіть тільки найбільший спільний дільник.
