// Task 1 ============================================
/* Додайте на блок .div-1 подію клік і по кліку запуск функції t1. Функція повинна повертати та виводити на екран вміст блоку (тільки текст). Вивід здійснюється у out-1.  */

const div1 = document.querySelector("#div-1");
const out1 = document.querySelector("#out-1");

// function t1() {
//   out1.textContent = div1.textContent;
// }

// div1.addEventListener("click", t1);

div1.addEventListener("click", () => {
  out1.textContent = div1.textContent;
});

Math.floor(Math.random() * 100) + 1; // диапазон от 1 до 100
Math.floor(Math.random() * 100); // диапазон от 0 до 99
Math.round(Math.random() * 100); // диапазон от 0 до 100
Math.ceil(Math.random() * 100); // диапазон от 1 до 100

// Task 2 ============================================
/*  Додайте на блок div-2 подію клік і по кліку запуск функції t2. Функція повинна повертати true або false в залежності від того, чи натиснута клавіша alt чи ні в момент кліка. Також, виводьте на екран результат. Вивід здійснюється у out-2. */

// Task 3 ============================================
/*  Додайте на блок div-3 подію клік. При натисканні - збільшуйте ширину блоку на 5px. Кожен клік – збільшення ширини на 5px. 10 кліків - на 50px. Ширину виводьте у out-3. */

// Task 4 ============================================
/*  
Напишіть код, який при натисненні на кнопку генерує випадкове число від 0 до 100 і виводить його.
*/

// Task 5 ============================================
/*  
Якщо натиснути кнопку, текст має бути прихованим. При повторному натисканні – текст знову з'являється.
*/

// Task 6 ============================================
/*  Даний блок div-6. Всередині блоку - зображення 1.png. При наведенні миші – змінюйте зображення на 2.png. При відведенні миші - кнопки миші, повертайте вихідне зображення. */

// Task 7 ============================================
/*  Даний блок div-7. Додати до нього подію move. При кожному русі миші збільшуйте число всередині на 1. */

// Task 8 ============================================
/*  Даний блок div-8. Додати до нього подію move. При кожному русі миші збільшуйте ширину блоку на 1px. */

// Task 9 ============================================
/*  Створіть блок зі списком новин. Біля кожної новини має бути кнопка Видалити, при натисканні на яку відповідна новина зникає. Також створіть кнопку Hide / Show для відображення новини. */
